fedetft/flopsync/drivers/cc2520.cpp
/***************************************************************************
 *   Copyright (C) 2012 by Terraneo Federico                               *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/

#include "cc2520.h"
#include "cc2520_config.h"
#include "timer.h"
#include <miosix.h>
#include <cstring>
#include "../test_cc2520/test_config.h"
#include <../miosix/kernel/scheduler/scheduler.h>

using namespace miosix;

static Thread *waiting=0;
static volatile bool xoscInterrupt=false;

/**
 * EXTI9_5 is connected to the so(PA6) of spi pin, this for irq xosc start
 */
void __attribute__((naked)) EXTI9_5_IRQHandler()
{
	saveContext();
	asm volatile("bl _Z18xoscIrqhandlerImplv");
	restoreContext();
}

/**
 * xosx actual implementation
 */
void __attribute__((used)) xoscIrqhandlerImpl()
{
    EXTI->PR=EXTI_PR_PR6;
    EXTI->IMR &= ~EXTI_IMR_MR6;
    EXTI->RTSR &= ~EXTI_RTSR_TR6;
    xoscInterrupt=true;
    if(!waiting) return;
    waiting->IRQwakeup();
	  if(waiting->IRQgetPriority()>Thread::IRQgetCurrentThread()->IRQgetPriority())
		Scheduler::IRQfindNextThread();
    waiting=0;
}


//
// class Cc2520
//

Cc2520& Cc2520::instance()
{
    static  Cc2520 singleton;
    return singleton;
}

Cc2520::Cc2520() :  autoFCS(true), mode(DEEP_SLEEP),timer(VHT::instance())
{
    cc2520GpioInit();
    setMode(DEEP_SLEEP);  //entry state of FSM
}

void Cc2520::setMode(Mode mode)
{
    unsigned char status;
    switch(mode)
    {
        case TX: 
            switch(this->mode)
            {
                case TX:
                    break;
                case RX:
                    status = commandStrobe(CC2520_INS_SRFOFF); //radio in IDLE
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    commandStrobe(CC2520_INS_SFLUSHTX); //flush TX FIFO
                    break;
                case SLEEP:
                    commandStrobe(CC2520_INS_SXOSCON); //turn on crystal oscillator
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();

                    commandStrobe(CC2520_INS_SFLUSHTX); //flush TX FIFO
                    break;
                case DEEP_SLEEP:
                    //reset device whit RESETn that automatically start crystal osc.
                    cc2520::reset::low(); //take low for >= 0.1ms     
                    cc2520::vreg::high();
                    timer.wait(static_cast<unsigned long long> (0.0001f*vhtFreq+0.5f));
                    cc2520::reset::high();
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();
                    initConfigureReg();
                    commandStrobe(CC2520_INS_SFLUSHTX); //flush TX FIFO
                   
                    #if CC2520_DEBUG>0
                    xosc_radio_boot::high();
                    #endif//CC2520_DEBUG
                    break;
                case IDLE:
                    commandStrobe(CC2520_INS_SFLUSHTX); //flush TX FIFO
                    break;
            }            
            break;
        case RX: 
            switch(this->mode)
            {
                case TX:
                    status = commandStrobe(CC2520_INS_SFLUSHRX); //flush RX FIFO
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    status = commandStrobe(CC2520_INS_SRXON); //Receive mode
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
                case RX:
                    break;
                case SLEEP:
                    status = commandStrobe(CC2520_INS_SXOSCON); //turn on crystal oscillator
                    isExcRaised(CC2520_EXC_OPERAND_ERROR, status);
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();
                    status = commandStrobe(CC2520_INS_SFLUSHRX); //flush RX FIFO
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    status = commandStrobe(CC2520_INS_SRXON); //Receive mode
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
                case DEEP_SLEEP:
                    //reset device whit RESETn that automatically start crystal osc.
                    cc2520::reset::low(); //take low for 0.2ms     
                    cc2520::vreg::high();
                    timer.wait(static_cast<unsigned long long> (0.0001f*vhtFreq+0.5f));
                    cc2520::reset::high();
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();
                    initConfigureReg();
                    status = commandStrobe(CC2520_INS_SFLUSHRX); //flush RX FIFO
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    status = commandStrobe(CC2520_INS_SRXON); //Receive mode
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    #if CC2520_DEBUG>0
                    xosc_radio_boot::high();
                    #endif//CC2520_DEBUG
                    break;
                case IDLE:
                    status = commandStrobe(CC2520_INS_SFLUSHRX); //flush RX FIFO
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    status = commandStrobe(CC2520_INS_SRXON); //Receive mode
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
            }
            break;
        case SLEEP: 
            switch(this->mode)
            {
                case TX:
                    status = commandStrobe(CC2520_INS_SRFOFF); //radio in IDLE
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status); 
                    //Turn off the crystal oscillator 
                    status = commandStrobe(CC2520_INS_SXOSCOFF);
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
                case RX:
                    status = commandStrobe(CC2520_INS_SRFOFF); //radio in IDLE
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status); 
                    //Turn off the crystal oscillator 
                    status = commandStrobe(CC2520_INS_SXOSCOFF);
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
                case SLEEP:
                    break;
                case DEEP_SLEEP :
                    break;
                case IDLE:
                    //Turn off the crystal oscillator ()
                    status = commandStrobe(CC2520_INS_SXOSCOFF);
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
            }
            break;
        case DEEP_SLEEP: 
            switch(this->mode)
            {
                case TX:
                case RX:
                case SLEEP:                  
                case IDLE:
                    //reset device will remove side effect 
                    cc2520::reset::low(); //take low for 0.1ms
                    timer.wait(static_cast<unsigned long long> (0.0001f*vhtFreq+0.5f));
                    cc2520::cs::high();        
                    cc2520::vreg::low();
                    cc2520::reset::high();
                    break; 
               case DEEP_SLEEP:
                    break;
            }
            break;
        case IDLE: 
            switch(this->mode)
            {
                case TX:
                case RX:
                    status = commandStrobe(CC2520_INS_SRFOFF); //radio in IDLE
                    isExcRaised(CC2520_EXC_USAGE_ERROR, status);
                    isExcRaised(CC2520_EXC_RX_FRM_ABORTED, status);
                    break;
                case SLEEP:
                    commandStrobe(CC2520_INS_SXOSCON);
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();
                    #if CC2520_DEBUG>0
                    xosc_radio_boot::high();
                    #endif//CC2520_DEBUG
                    break;
                case DEEP_SLEEP :
                    //reset device whit RESETn that automatically start crystal osc.
                    cc2520::reset::low(); //take low for 0.1ms     
                    cc2520::vreg::high();
                    timer.wait(static_cast<unsigned long long> (0.0001f*vhtFreq+0.5f));
                    cc2520::reset::high();
                    cc2520::cs::low();
                    //wait until SO=1 (clock stable and running)
                    wait();
                    cc2520::cs::high();
                    initConfigureReg();
                    break;
                case IDLE:
                    break;
            }
            break;  
    }
    this->mode=mode;
    #if CC2520_DEBUG >1
    switch (this->mode)
    {
        case 0: printf("--CC2520_DEBUG-- Setting mode: TX\n");
            break;
        case 1: printf("--CC2520_DEBUG-- Setting mode: RX \n");
            break;
        case 2: printf("--CC2520_DEBUG-- Setting mode: SLEEP\n");
            break;
        case 3: printf("--CC2520_DEBUG-- Setting mode: IDLE\n");
            break;
        case 4: printf("--CC2520_DEBUG-- Setting mode: DEEP_SLEEP\n");
            break;
    }
    #endif //CC2520_DEBUG
    return;
}
    
