fedetft/flopsync/drivers/cc2520.cpp
void Cc2520::setFrequency(unsigned short freq)
{
    if(freq<2394 || freq>2507) return;
    this->frequency = freq;
    if(this->mode != SLEEP && this->mode != DEEP_SLEEP) 
        writeReg(CC2520_FREQCTRL,freq-2394);
}

void Cc2520::setFrequencyChannel(unsigned char channel)
{
    if(channel<11 || channel>26) return;
    Cc2520::setFrequency(2405 + 5*(channel-11));
}

void Cc2520::setShortAddress(const unsigned char address[2])
{
    memcpy(this->shortAddress,address,2);
    if(this->mode != SLEEP && this->mode != DEEP_SLEEP){
    cc2520::cs::low();
    delay();
    
    //little endian
    cc2520SpiSendRecv(CC2520_INS_MEMORY_WRITE | 0x3);
    cc2520SpiSendRecv(0xf4);
    cc2520SpiSendRecv(address[1]);
    cc2520SpiSendRecv(CC2520_INS_MEMORY_WRITE | 0x3);
    cc2520SpiSendRecv(0xf5);
    cc2520SpiSendRecv(address[0]);
    
    cc2520::cs::high();
    delay();
    }
}

void Cc2520::setPanId(const unsigned char panId[])
{
    memcpy(this->panId,panId,2);
    if (this->mode != SLEEP  && this->mode != DEEP_SLEEP) 
    {
        cc2520::cs::low();
        delay();

        //little endian
        cc2520SpiSendRecv(CC2520_INS_MEMORY_WRITE | 0x3);
        cc2520SpiSendRecv(0xf2);
        cc2520SpiSendRecv(panId[1]);
        cc2520SpiSendRecv(CC2520_INS_MEMORY_WRITE | 0x3);
        cc2520SpiSendRecv(0xf3);
        cc2520SpiSendRecv(panId[0]);

        cc2520::cs::high();
        delay();
    }
}

int Cc2520::writeFrame(unsigned char length, const unsigned char* pframe)
{
    if(this->mode != TX) return -3;
    if(pframe==NULL) return -2;
    if (length<1 || length>127 ) return -1; 
    cc2520::cs::low();
    delay();
    unsigned char status = cc2520SpiSendRecv(CC2520_INS_TXBUF);
    cc2520SpiSendRecv(length+autoFCS*SIZE_AUTO_FCS); //adding 2 bytes of FCS
    for(int i=0; i<length; i++) cc2520SpiSendRecv(pframe[i]);
    cc2520::cs::high();
    delay();
    if(isExcRaised(CC2520_EXC_TX_OVERFLOW,status)) return 1;
    return 0;
}

int Cc2520::writeFrame(const Frame& frame)
{
    if(this->mode != TX) return -3;
    if(frame.isNotInit()) return -1; //invalid parameter
    cc2520::cs::low();
    delay();
    unsigned char status = cc2520SpiSendRecv(CC2520_INS_TXBUF);
    Frame::ConstIterator i; 
    Frame::ConstIterator end = frame.end();
    #if CC2520_DEBUG >1
        Frame::ConstIterator b=frame.begin(); 
        Frame::ConstIterator e=frame.end();
        printf("--CC2520_DEBUG-- Frame LEN: %d\n",e-b);    
    #endif //CC2520_DEBUG
    for(i=frame.begin(); i<end; i++) {
        cc2520SpiSendRecv(*i);
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- Byte to send: %x \n",*i);  
        #endif //CC2520_DEBUG
    }
    cc2520::cs::high();
    delay();
    if(isExcRaised(CC2520_EXC_TX_OVERFLOW,status)) return 1; //exc tx overflow
    return 0; //ok
}

int Cc2520::readFrame(unsigned char& length, unsigned char* pframe) const
{
    if(this->mode != RX) return -3;
    short int result = 0;
    if(pframe==NULL) return -2;
    if (length<1 || length>127 ) return -1; 
    unsigned char currLen;
    cc2520::cs::low();
    delay();
    unsigned char status = cc2520SpiSendRecv(CC2520_INS_RXBUF);
    currLen = cc2520SpiSendRecv()-2*autoFCS;
    if(currLen>length)
    {
        for(int i=0; i<currLen; i++) 
            (currLen<=length) ? pframe[i]=cc2520SpiSendRecv() 
                                                : cc2520SpiSendRecv();
        result = 0;
    }else
    {
        for(int i=0; i<currLen; i++) pframe[i]=cc2520SpiSendRecv();
        length = currLen;
        result = 1;
    }
    //read the two byte FCS
    unsigned char fcs =0;
    if(autoFCS)
    {
        fcs=cc2520SpiSendRecv();
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- First byte RSSI: %ddBm\n",((char)fcs)-76);
        #endif //CC2520_DEBUG
        fcs=cc2520SpiSendRecv();
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- Second byte CRC+Correlation value: %x\n",fcs);
        #endif //CC2520_DEBUG
    }
    cc2520::cs::high();
    delay();
    isExcRaised(CC2520_EXC_RX_FRM_DONE);  //clear FRM_DONE exc
    if(isExcRaised(CC2520_EXC_RX_UNDERFLOW,status)) return 2;
    if(autoFCS)
        if ((fcs & 0x80)==0x00)  return 3;  //fcs incorrect
    return result; 
}

int Cc2520::readFrame(Frame& frame) const
{
    if(this->mode != RX) return -3;
    if(!frame.isNotInit() || frame.isAutoFCS()!=autoFCS) return -1;
    
    cc2520::cs::low();
    delay();
    
    unsigned char status = cc2520SpiSendRecv(CC2520_INS_RXBUF);
    if(!frame.initFrame(cc2520SpiSendRecv())) 
    {
        cc2520::cs::high();
        delay();
        flushRxFifoBuffer();
        return -1;
    }
    Frame::Iterator i;
    Frame::Iterator end = frame.end();
    #if CC2520_DEBUG >1
        Frame::Iterator b=frame.begin(); 
        Frame::Iterator e=frame.end();
        printf("--CC2520_DEBUG-- Frame LEN: %d\n",e-b);    
    #endif //CC2520_DEBUG
    for(i = frame.begin(); i<end; i++) {
        *i = cc2520SpiSendRecv();
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- payload: %x \n",*i);  
        #endif //CC2520_DEBUG
    }
    unsigned char fcs=0;
    if(autoFCS)
    {
        fcs=cc2520SpiSendRecv();
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- First byte RSSI: %ddBm\n",((char)fcs)-76);
        #endif //CC2520_DEBUG
        fcs=cc2520SpiSendRecv();
        #if CC2520_DEBUG >1
            printf("--CC2520_DEBUG-- Second byte fcs: %x\n",fcs);
        #endif //CC2520_DEBUG
    }
    cc2520::cs::high();
    delay();
    isExcRaised(CC2520_EXC_RX_FRM_DONE); //clear RX_FRM_DONE exc
    if(isExcRaised(CC2520_EXC_RX_UNDERFLOW,status)) return 1;
    if(autoFCS)
    {
        if ((fcs & 0x80)==0x00 )  return 2;  //fcs incorrect
    }
    return 0;
}

int Cc2520::flushTxFifoBuffer() const
{
    if(this->mode == SLEEP || this->mode == DEEP_SLEEP ) return -1;
    //reset RX exception
    #if CC2520_DEBUG >1
        printf("--CC2520_DEBUG-- Flush TX FIFO buffer\n");   
    #endif //CC2520_DEBUG
    writeReg(CC2520_EXCFLAG0,CC2520_EXC_TX_FRM_DONE |
                             CC2520_EXC_TX_ACK_DONE |  
                             CC2520_EXC_TX_UNDERFLOW |
                             CC2520_EXC_TX_OVERFLOW); 
    commandStrobe(CC2520_INS_SFLUSHTX);
    return true;
}

int Cc2520::flushRxFifoBuffer() const
{
    if(this->mode == SLEEP || this->mode == DEEP_SLEEP ) return -1;
    //reset RX exception
    #if CC2520_DEBUG >1
        printf("--CC2520_DEBUG-- Flush RX FIFO buffer\n");   
    #endif //CC2520_DEBUG
    writeReg(CC2520_EXCFLAG0,CC2520_EXC_RX_OVERFLOW);
    writeReg(CC2520_EXCFLAG1,CC2520_EXC_RX_FRM_DONE |
                             CC2520_EXC_RX_FRM_ACCEPETED |
                             CC2520_EXC_SR_MATCH_DONE |
                             CC2520_EXC_SR_MATCH_FOUND |
                             CC2520_EXC_FIFOP |
                             CC2520_EXC_SFD);
    writeReg(CC2520_EXCFLAG2,CC2520_EXC_RX_FRM_ABORTED |
                             CC2520_EXC_RXBUFMOV_TIMEOUT);
    
    commandStrobe(CC2520_INS_SFLUSHRX);
    return true;
}

int Cc2520::sendTxFifoFrame() const
{
    if(this->mode != TX) return -1;
    return !isExcRaised(CC2520_EXC_RX_FRM_ABORTED, commandStrobe(CC2520_INS_STXON));
}

