fedetft/flopsync/drivers/cc2520.cpp
int Cc2520::isSFDRaised() const
{
    if(this->mode != TX && this->mode != RX ) return -1;
    return isExcRaised(CC2520_EXC_SFD);
}


int Cc2520::isTxFrameDone() const
{
    if(this->mode != TX) return -1;
    return isExcRaised(CC2520_EXC_TX_FRM_DONE);
}

int Cc2520::isRxFrameDone() const
{
    if(this->mode != RX) return -1;
    
    if(isExcRaised(CC2520_EXC_RX_OVERFLOW))
    {
        #if CC2520_DEBUG >1
            commandStrobe(CC2520_INS_SFLUSHRX);
            unsigned char f0;
            unsigned char f1;
            unsigned char f2;
            readReg(CC2520_EXCFLAG0, f0);
            readReg(CC2520_EXCFLAG1, f1);
            readReg(CC2520_EXCFLAG2, f2);
            printf("--CC2520_DEBUG-- ---------------------------Buffer overflow!\n    "
                    "EXCFLAG0: %x\n     "
                    "EXCFLAG1: %x\n    "
                    "EXCFLAG2: %x\n",f0,f1,f2);
            
        #endif //CC2520_DEBUG
        flushRxFifoBuffer();
        return false;
    }
    return isExcRaised(CC2520_EXC_RX_FRM_DONE);
}

int Cc2520::isRxBufferNotEmpty() const
{
    if(this->mode != RX) return -1;
    if(cc2520::fifo_irq::value()==0 && cc2520::fifop_irq::value()==1)
    {
        #if CC2520_DEBUG >1
           commandStrobe(CC2520_INS_SFLUSHRX);
           printf("--CC2520_DEBUG-- Buffer overflow!\n");
           unsigned char f0;
            unsigned char f1;
            unsigned char f2;
            readReg(CC2520_EXCFLAG0, f0);
            readReg(CC2520_EXCFLAG1, f1);
            readReg(CC2520_EXCFLAG2, f2);
            printf("--CC2520_DEBUG-- Buffer overflow!\n    "
                    "EXCFLAG0: %x\n     "
                    "EXCFLAG1: %x\n    "
                    "EXCFLAG2: %x\n",f0,f1,f2);
        #endif //CC2520_DEBUG
        flushRxFifoBuffer();
        return false;
    }else if(cc2520::fifo_irq::value()==1 || cc2520::fifop_irq::value()==1)
    {
        return true;
    }
    return false;
}
Cc2520::Mode Cc2520::getMode() const
{
    return this->mode;
}

void Cc2520::setAutoFCS(bool fcs)
{
    autoFCS = fcs;
    if(this->mode != SLEEP && this->mode != DEEP_SLEEP)
            writeReg(CC2520_FRMCTRL0,0x40*fcs);
}


bool Cc2520::writeReg(Cc2520FREG reg, unsigned char data) const
{
    if(reg>0x3F) return false;
    cc2520::cs::low();
    delay();
    cc2520SpiSendRecv(CC2520_INS_REGISTER_WRITE | reg);
    cc2520SpiSendRecv(data);
    cc2520::cs::high();
    delay();
    return true;  
}


bool Cc2520::writeReg(Cc2520SREG reg, unsigned char data) const
{
    if(reg>0x7E) return false;
    cc2520::cs::low();
    delay();
    cc2520SpiSendRecv(CC2520_INS_MEMORY_WRITE);
    cc2520SpiSendRecv(reg);
    cc2520SpiSendRecv(data);
    cc2520::cs::high();
    delay();
    return true;
}

bool Cc2520::readReg(Cc2520FREG reg, unsigned char& result) const
{
    if(reg>0x3F) return false;
    cc2520::cs::low();
    delay();
    cc2520SpiSendRecv(CC2520_INS_REGISTER_READ | reg);
    result =cc2520SpiSendRecv();
    cc2520::cs::high();
    delay();
    return true;
}

 bool Cc2520::readReg(Cc2520SREG reg, unsigned char& result) const
{
    if(reg>0x7E) return false;
    cc2520::cs::low();
    delay();
    cc2520SpiSendRecv(CC2520_INS_MEMORY_READ);
    cc2520SpiSendRecv(reg);
    result =cc2520SpiSendRecv();
    cc2520::cs::high();
    delay();
    return true;
}



unsigned char Cc2520::readStatus() const
{
    cc2520::cs::low();
    delay();
    unsigned char result=cc2520SpiSendRecv(CC2520_INS_SNOP); //NOP command
    cc2520::cs::high();
    delay();
    return result;
}

unsigned char Cc2520::commandStrobe(Cc2520SpiIsa ins) const
{
    unsigned char status;
    cc2520::cs::low();
    delay();
    status = cc2520SpiSendRecv(ins);
    cc2520::cs::high();
    delay();
    return status;
}

bool Cc2520::isExcRaised(Cc2520Exc0 exc, unsigned char status) const
{
    if((status & CC2520_STATUS_EXC_A) == CC2520_STATUS_EXC_A ||
            ((status & CC2520_STATUS_EXC_B) == CC2520_STATUS_EXC_B))
    {
        unsigned char result;
        cc2520::cs::low();
        delay();
        cc2520SpiSendRecv(CC2520_INS_REGISTER_READ | CC2520_EXCFLAG0);
        result =cc2520SpiSendRecv();
        cc2520::cs::high();
        delay();
        
        if((result & exc )== exc) 
        {
            #if CC2520_DEBUG >2
                printf("--CC2520_DEBUG-- Exception EXCFLAG0: %x\n",exc);
            #endif //CC2520_DEBUG
            //clear exception
            //bit to 1 will not result in a register change
            cc2520::cs::low();
            delay();
            cc2520SpiSendRecv(CC2520_INS_REGISTER_WRITE | CC2520_EXCFLAG0);
            cc2520SpiSendRecv(~exc);
            cc2520::cs::high();
            delay();
            return true;
        }
    }
    return false;
}

bool Cc2520::isExcRaised(Cc2520Exc1 exc, unsigned char status) const
{
    if((status & CC2520_STATUS_EXC_A) == CC2520_STATUS_EXC_A ||
            ((status & CC2520_STATUS_EXC_B) == CC2520_STATUS_EXC_B))
    {
        unsigned char result;
        cc2520::cs::low();
        delay();
        cc2520SpiSendRecv(CC2520_INS_REGISTER_READ | CC2520_EXCFLAG1);
        result =cc2520SpiSendRecv();
        cc2520::cs::high();
        delay();
        
        if((result & exc )== exc)  
        {
            #if CC2520_DEBUG >2
                printf("--CC2520_DEBUG-- Exception EXCFLAG1: %x\n",exc);
            #endif //CC2520_DEBUG
            //clear exception
            //bit to 1 will not result in a register change
            cc2520::cs::low();
            delay();
            cc2520SpiSendRecv(CC2520_INS_REGISTER_WRITE | CC2520_EXCFLAG1);
            cc2520SpiSendRecv(~exc);
            cc2520::cs::high();
            delay();
            return true;
        }
    }
    return false;
}

bool Cc2520::isExcRaised(Cc2520Exc2 exc, unsigned char status) const
{
    if((status & CC2520_STATUS_EXC_A) == CC2520_STATUS_EXC_A ||
            ((status & CC2520_STATUS_EXC_B) == CC2520_STATUS_EXC_B))
    {
        unsigned char result;
        cc2520::cs::low();
        delay();
        cc2520SpiSendRecv(CC2520_INS_REGISTER_READ | CC2520_EXCFLAG2);
        result =cc2520SpiSendRecv();
        cc2520::cs::high();
        delay();
        
