fedetft/flopsync/drivers/cc2520.cpp
        if((result & exc )== exc) 
        {
            #if CC2520_DEBUG >2
                printf("--CC2520_DEBUG-- Exception EXCFLAG2: %x\n",exc);
            #endif //CC2520_DEBUG
            //clear exception
            //bit to 1 will not result in a register change
            cc2520::cs::low();
            delay();
            cc2520SpiSendRecv(CC2520_INS_REGISTER_WRITE | CC2520_EXCFLAG2);
            cc2520SpiSendRecv(~exc);
            cc2520::cs::high();
            delay();
            return true;
        }
    }
    return false;
}

void Cc2520::initConfigureReg()
{    
    writeReg(CC2520_FREQCTRL,this->frequency-2394); //set frequency
    writeReg(CC2520_FRMCTRL0,0x40*autoFCS); //automatically add FCS
    writeReg(CC2520_FRMCTRL1,0x2); //ignore tx underflow exception
    writeReg(CC2520_TXPOWER,0x32); //TX power 0 dBm
    writeReg(CC2520_FIFOPCTRL,0x7F); //fifop threshold
    
    //No 12 symbol timeout after frame reception has ended. (192us)
    writeReg(CC2520_FSMCTRL,0x0);
    
    //10   2 zero simbols
    //0    Lock average level after preamble match
    //0010 4 leading zero bytes of preamble length in TX
    //0    Normal TX filtering
    writeReg(CC2520_MDMCTRL0,0x85); //controls modem
    writeReg(CC2520_MDMCTRL1,0x14); //controls modem
    writeReg(CC2520_FRMFILT0,0x00); //disable frame filtering
    writeReg(CC2520_FRMFILT1,0x00); //disable frame filtering
    writeReg(CC2520_SRCMATCH,0x00); //disable source matching
    
    //Automatically flush tx buffer when an exception buffer overflow take place
    //writeReg(CC2520_EXCBINDX0,0x0A);
    //writeReg(CC2520_EXCBINDX1,0x80 | 0x06 );
    
    //Setting all exception on channel A 
    writeReg(CC2520_EXCMASKA0,0XFF);
    writeReg(CC2520_EXCMASKA1,0XFF);
    writeReg(CC2520_EXCMASKA2,0XFF);
    
    //Setting SFD, TX_FRM_DONE, RX_FRM_DONE on channel B
    writeReg(CC2520_EXCMASKB0,CC2520_EXC_TX_FRM_DONE);
    writeReg(CC2520_EXCMASKB1,CC2520_EXC_RX_FRM_DONE | CC2520_EXC_SFD);
    writeReg(CC2520_EXCMASKB2,0X00);
    
    //Register that need to update from their default value
    writeReg(CC2520_RXCTRL,0x3f);
    writeReg(CC2520_FSCTRL,0x5a);
    writeReg(CC2520_FSCAL1,0x2b);
    writeReg(CC2520_AGCCTRL1,0x11);
    writeReg(CC2520_ADCTEST0,0x10);
    writeReg(CC2520_ADCTEST1,0x0E);
    writeReg(CC2520_ADCTEST2,0x03);
    
    //Setting gpio5 as input on rising edge send command strobe STXON
    writeReg(CC2520_GPIOCTRL5,0x80|0x08);
    //Setting gpio3 as output exception channel B
    writeReg(CC2520_GPIOCTRL3,0x22);
    
    #if CC2520_DEBUG >2
    printf("--CC2520_DEBUG-- Registers initialized.\n");
    #endif //CC2520_DEBUG
}

void Cc2520::wait()
{
    FastInterruptDisableLock dLock;
    EXTI->IMR |= EXTI_IMR_MR6;
    EXTI->RTSR |= EXTI_RTSR_TR6;
    EXTI->PR=EXTI_PR_PR6; //Clear eventual pending IRQ 
    xoscInterrupt=false;
    while(!xoscInterrupt)
    {
        waiting=Thread::IRQgetCurrentThread();
        Thread::IRQwait();
        {
            FastInterruptEnableLock eLock(dLock);
            Thread::yield();
        }
    }
}